In [1]:
#Install pandas
!pip install pandas
import pandas as pd

Requirement already satisfied: pandas in c:\users\vikipedia\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\vikipedia\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\vikipedia\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\vikipedia\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\vikipedia\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd
import pandas

In [3]:
#create a numeric series
numbers = range(1,100,5)
pd.Series (numbers) 
#argument
#numbers between 1 to 100, in steps of 5 
#range(start,stop,step)
#index 0 is 1, index 1 is 6

#dtype: int64 is the computer estimation of potential memories that this series can take
# in python row names are called index or indices
#data type interger

0      1
1      6
2     11
3     16
4     21
5     26
6     31
7     36
8     41
9     46
10    51
11    56
12    61
13    66
14    71
15    76
16    81
17    86
18    91
19    96
dtype: int64

In [4]:
#create an object series, the data tyoe of this series is an object
string = "Hi","how","are","you","?"
pd.Series(string)

0     Hi
1    how
2    are
3    you
4      ?
dtype: object

In [5]:
#create a series by giving both numeric and string values, with arbitrary list
#data type = object
s=pd.Series([345,'London',34.5,-34.45,'Happy Birthday'])
s

0               345
1            London
2              34.5
3            -34.45
4    Happy Birthday
dtype: object

In [6]:
#the index is added using the argument "index=". The data type of the series continues to be numeric
marks = [60,89,74,86]
subject=["Maths","Science","English","Social Science"]
pd.Series(marks,index=subject)

Maths             60
Science           89
English           74
Social Science    86
dtype: int64

In [7]:
#pd.Series(dictionary)
data = {'Math':60,'Science':89,'English':74,'Social Science':86}
pd.Series(data)
#On passing a dict,the index in the resulting series will have the dict's keys in sorted order

Math              60
Science           89
English           74
Social Science    86
dtype: int64

In [8]:
#a series with missing values
subjects=["Math","Science","Art and Craft","Social Science"]

marks_series = pd.Series(data,index = subjects)
marks_series

Math              60.0
Science           89.0
Art and Craft      NaN
Social Science    86.0
dtype: float64

In [9]:
marks_series.notnull()

Math               True
Science            True
Art and Craft     False
Social Science     True
dtype: bool

In [10]:
#to know the series which score is more than 75
marks_series[marks_series>75]

Science           89.0
Social Science    86.0
dtype: float64

In [11]:
#to assign 68 marks to Art and Craft
marks_series["Art and Craft"]=68
marks_series

Math              60.0
Science           89.0
Art and Craft     68.0
Social Science    86.0
dtype: float64

In [12]:
#to check if Maths marks are 73
marks_series.Math == 73

False

In [13]:
marks_series["Math"]==73

False

In [14]:
#sort numeric series
#step 1 create a series
values = pd.Series([23,45,41,23,34,55,34,20])
#step 2 ascending order
values.sort_values(ascending=True)

7    20
0    23
3    23
4    34
6    34
2    41
1    45
5    55
dtype: int64

In [15]:
#descending
values.sort_values(ascending=False)

5    55
1    45
2    41
6    34
4    34
3    23
0    23
7    20
dtype: int64

In [16]:
#sorting categorical series
#create a string
string_values = pd.Series(["a","j","d","f","t","a"])
string_values.sort_values(ascending=True)

0    a
5    a
2    d
3    f
1    j
4    t
dtype: object

In [17]:
#rank a series
marks_series.rank(ascending = True)

Math              1.0
Science           4.0
Art and Craft     2.0
Social Science    3.0
dtype: float64

In [18]:
import numpy as np
data=np.arange(10)
new_ser=pd.Series(data=data)
new_ser[new_ser==5]

5    5
dtype: int32

In [19]:
#creating a data frame from a dictionary
data ={'Subject':['Maths','History','Science','English','Georaphy','Art'],
      'Marks':(45,65,78,65,80,78),
      'CGPA':[2.5,3.0,3.5,2.0,4.0,4.0]}

df=pd.DataFrame(data)
print(df)

#Like Series, the resulting DataFrame is assigned index automatically. And the 'Marks' values are in a tuple

    Subject  Marks  CGPA
0     Maths     45   2.5
1   History     65   3.0
2   Science     78   3.5
3   English     65   2.0
4  Georaphy     80   4.0
5       Art     78   4.0

In [20]:
#Create a dataframe from series
Subject = pd.Series(['Maths','History','Science','English','Georaphy','Art'])
Marks = pd.Series([45,65,78,65,80,78])
CGPA = pd.Series([2.5,3.0,3.5,2.0,4.0,4.0])
pd.DataFrame([Subject,Marks,CGPA], index =['Subject','Marks','CGPA']).T

#T for transpose

    Subject Marks CGPA
0     Maths    45  2.5
1   History    65    3
2   Science    78  3.5
3   English    65    2
4  Georaphy    80    4
5       Art    78    4

In [21]:
#to read data from csv file
data = pd.read_csv("example.csv")
type(data)
pandas.core.frame.DataFrame
data

    age  weight  height
0    45      60    1.67
1    12      45    1.78
2    30      55    1.58
3    54      67    1.65
4    23      46    1.90
5    45      55    1.95
6    45      54    2.00
7    34      45    1.65
8    67      57    1.79
9    65      77    1.76
10   45      65    1.75
11   34      44    1.95
12   31      55    1.58
13   26      55    1.58

In [22]:
data.head()

   age  weight  height
0   45      60    1.67
1   12      45    1.78
2   30      55    1.58
3   54      67    1.65
4   23      46    1.90

In [23]:
#first 3
data.head(3)

   age  weight  height
0   45      60    1.67
1   12      45    1.78
2   30      55    1.58

In [24]:
#last 5
data.tail(5)

    age  weight  height
9    65      77    1.76
10   45      65    1.75
11   34      44    1.95
12   31      55    1.58
13   26      55    1.58

In [25]:
#to get dimensions of a dataframe
data.shape

(14, 3)

In [26]:
#to know the data types of a data frame 
data.dtypes

age         int64
weight      int64
height    float64
dtype: object

In [27]:
#to know the info of data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     14 non-null     int64
 1   weight  14 non-null     int64
 2   height  14 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 464.0 bytes

In [28]:
#to check the data type of column in the data frame
type(data.age)

pandas.core.series.Series

In [29]:
type(data.weight)

pandas.core.series.Series

In [30]:
#read .xlsx file
pd.read_excel('schedule Time Zone.xlsx')

        IST  11:30:00 2022-03-24 12:00:00
0    Geneva  07:00:00 2022-03-24 07:30:00
1  Shanghai  13:00:00 2022-03-24 14:30:00
2    London  06:00:00 2022-03-24 06:30:00
3  New York  01:00:00 2022-03-24 02:30:00
4    Canada  01:00:00 2022-03-24 02:30:00

In [31]:
#read a .zip file
import zipfile
with zipfile.ZipFile('AdventureWorks_Calendar.zip')as z:
    with z.open('example.csv') as f:
        file = pd.read_csv(f)
        print(file.head())

KeyError: "There is no item named 'example.csv' in the archive"

In [32]:
data = pd.read_csv("example.csv")
type(data)
pandas.core.frame.DataFrame
data

    age  weight  height
0    45      60    1.67
1    12      45    1.78
2    30      55    1.58
3    54      67    1.65
4    23      46    1.90
5    45      55    1.95
6    45      54    2.00
7    34      45    1.65
8    67      57    1.79
9    65      77    1.76
10   45      65    1.75
11   34      44    1.95
12   31      55    1.58
13   26      55    1.58

In [33]:
data["BMI"]=data["weight"]/data["height"]**2
data

    age  weight  height        BMI
0    45      60    1.67  21.513859
1    12      45    1.78  14.202752
2    30      55    1.58  22.031726
3    54      67    1.65  24.609734
4    23      46    1.90  12.742382
5    45      55    1.95  14.464168
6    45      54    2.00  13.500000
7    34      45    1.65  16.528926
8    67      57    1.79  17.789707
9    65      77    1.76  24.857955
10   45      65    1.75  21.224490
11   34      44    1.95  11.571335
12   31      55    1.58  22.031726
13   26      55    1.58  22.031726

In [34]:
data.shape

(14, 4)

In [35]:
#adding a row by using the function .copy()
data_copy=data.copy()
data_copy.loc[11]=[45,85,1.8,26.3]
data_copyb

    age  weight  height        BMI
0    45      60    1.67  21.513859
1    12      45    1.78  14.202752
2    30      55    1.58  22.031726
3    54      67    1.65  24.609734
4    23      46    1.90  12.742382
5    45      55    1.95  14.464168
6    45      54    2.00  13.500000
7    34      45    1.65  16.528926
8    67      57    1.79  17.789707
9    65      77    1.76  24.857955
10   45      65    1.75  21.224490
11   45      85    1.80  26.300000
12   31      55    1.58  22.031726
13   26      55    1.58  22.031726

In [36]:
#find an location of index or iloc, select the second row
data.iloc[2]

age       30.000000
weight    55.000000
height     1.580000
BMI       22.031726
Name: 2, dtype: float64

In [37]:
#select the 4th, 7th and 10th row
data.iloc[[4,7,10]]

    age  weight  height        BMI
4    23      46    1.90  12.742382
7    34      45    1.65  16.528926
10   45      65    1.75  21.224490

In [38]:
#select 2-10 rows 
data.iloc[2:11]

    age  weight  height        BMI
2    30      55    1.58  22.031726
3    54      67    1.65  24.609734
4    23      46    1.90  12.742382
5    45      55    1.95  14.464168
6    45      54    2.00  13.500000
7    34      45    1.65  16.528926
8    67      57    1.79  17.789707
9    65      77    1.76  24.857955
10   45      65    1.75  21.224490

In [39]:
#1st column
data.iloc[:,1]

0     60
1     45
2     55
3     67
4     46
5     55
6     54
7     45
8     57
9     77
10    65
11    44
12    55
13    55
Name: weight, dtype: int64

In [40]:
#choose "age" column
data.iloc[:,0]

0     45
1     12
2     30
3     54
4     23
5     45
6     45
7     34
8     67
9     65
10    45
11    34
12    31
13    26
Name: age, dtype: int64

In [41]:
#select the last column
data.iloc[:,-1]

0     21.513859
1     14.202752
2     22.031726
3     24.609734
4     12.742382
5     14.464168
6     13.500000
7     16.528926
8     17.789707
9     24.857955
10    21.224490
11    11.571335
12    22.031726
13    22.031726
Name: BMI, dtype: float64

In [42]:
#select the first 2 columns
data.iloc[:,0:2]

    age  weight
0    45      60
1    12      45
2    30      55
3    54      67
4    23      46
5    45      55
6    45      54
7    34      45
8    67      57
9    65      77
10   45      65
11   34      44
12   31      55
13   26      55

In [43]:
#the first 2 columns and 5 to 10 rows
data.iloc[5:11,0:2]

    age  weight
5    45      55
6    45      54
7    34      45
8    67      57
9    65      77
10   45      65

In [44]:
#DataFrame.loc[] method a method that takes only index labels and returns row or dataframe if the index label exists in the caller data frame.
#DataFrame.loc[Row_names, column_names] is used to select or index rows or columns based on their name
#select 1-5 rows and 2nd and 5th columns
data.loc[1:5,["weight","BMI"]]

#row names are numbers

   weight        BMI
1      45  14.202752
2      55  22.031726
3      67  24.609734
4      46  12.742382
5      55  14.464168

In [45]:
data.age
#only select one column

0     45
1     12
2     30
3     54
4     23
5     45
6     45
7     34
8     67
9     65
10    45
11    34
12    31
13    26
Name: age, dtype: int64

In [46]:
#select the column age and BMI
data[["age","BMI"]]

    age        BMI
0    45  21.513859
1    12  14.202752
2    30  22.031726
3    54  24.609734
4    23  12.742382
5    45  14.464168
6    45  13.500000
7    34  16.528926
8    67  17.789707
9    65  24.857955
10   45  21.224490
11   34  11.571335
12   31  22.031726
13   26  22.031726

In [47]:
data.head()

   age  weight  height        BMI
0   45      60    1.67  21.513859
1   12      45    1.78  14.202752
2   30      55    1.58  22.031726
3   54      67    1.65  24.609734
4   23      46    1.90  12.742382

In [48]:
#sort the data frame on the basis of "age" values
#byb default the values will be sorted by ascending order
data.sort_values('age')
#"ascending = False" will sort the data frame in descending order

    age  weight  height        BMI
1    12      45    1.78  14.202752
4    23      46    1.90  12.742382
13   26      55    1.58  22.031726
2    30      55    1.58  22.031726
12   31      55    1.58  22.031726
7    34      45    1.65  16.528926
11   34      44    1.95  11.571335
0    45      60    1.67  21.513859
5    45      55    1.95  14.464168
6    45      54    2.00  13.500000
10   45      65    1.75  21.224490
3    54      67    1.65  24.609734
9    65      77    1.76  24.857955
8    67      57    1.79  17.789707

In [49]:
#ranke the data frame 'data' in descending oeder based on"BMI"
#'method = min' assigns the minimum rank to highest equal value of 'BMI'
data['BMI_Ranked'] = data['BMI'].rank(ascending=0,method = 'min')
data

    age  weight  height        BMI  BMI_Ranked
0    45      60    1.67  21.513859         6.0
1    12      45    1.78  14.202752        11.0
2    30      55    1.58  22.031726         3.0
3    54      67    1.65  24.609734         2.0
4    23      46    1.90  12.742382        13.0
5    45      55    1.95  14.464168        10.0
6    45      54    2.00  13.500000        12.0
7    34      45    1.65  16.528926         9.0
8    67      57    1.79  17.789707         8.0
9    65      77    1.76  24.857955         1.0
10   45      65    1.75  21.224490         7.0
11   34      44    1.95  11.571335        14.0
12   31      55    1.58  22.031726         3.0
13   26      55    1.58  22.031726         3.0

In [51]:
#method = 'dense' assigns same rank to all the sa,e BMI values
data['BMI_densed_rank'] = data['BMI'].rank(method = 'dense')
data

    age  weight  height        BMI  BMI_Ranked  BMI_densed_rank
0    45      60    1.67  21.513859         6.0              9.0
1    12      45    1.78  14.202752        11.0              4.0
2    30      55    1.58  22.031726         3.0             10.0
3    54      67    1.65  24.609734         2.0             11.0
4    23      46    1.90  12.742382        13.0              2.0
5    45      55    1.95  14.464168        10.0              5.0
6    45      54    2.00  13.500000        12.0              3.0
7    34      45    1.65  16.528926         9.0              6.0
8    67      57    1.79  17.789707         8.0              7.0
9    65      77    1.76  24.857955         1.0             12.0
10   45      65    1.75  21.224490         7.0              8.0
11   34      44    1.95  11.571335        14.0              1.0
12   31      55    1.58  22.031726         3.0             10.0
13   26      55    1.58  22.031726         3.0             10.0

In [53]:
#check for missing values
missing_data= pd.read_csv("example_missingdata.csv")
missing_data

    age  weight  height
0    45     NaN    1.67
1    12    45.0    1.78
2    30    55.0    1.58
3    54    67.0    1.65
4    23    46.0    1.90
5    45    55.0    1.95
6    45    54.0    2.00
7    34    45.0    1.65
8    67    57.0    1.79
9    65    77.0    1.76
10   45    65.0    1.75
11   34    44.0    1.95
12   31    55.0    1.58
13   26    55.0    1.58
14   30     NaN    1.78
15   65    77.0    1.76

In [54]:
missing_data.isnull()

      age  weight  height
0   False    True   False
1   False   False   False
2   False   False   False
3   False   False   False
4   False   False   False
5   False   False   False
6   False   False   False
7   False   False   False
8   False   False   False
9   False   False   False
10  False   False   False
11  False   False   False
12  False   False   False
13  False   False   False
14  False    True   False
15  False   False   False

In [55]:
missing_data.isnull().sum()

age       0
weight    2
height    0
dtype: int64

In [56]:
data = {'A':[1,2,3,4,5], 'B':[1,0,1,1,0]}
df = pd.DataFrame(data=data)
df.C = df.A + df.B

<ipython-input-56-8d42cb36bc2c>:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.C = df.A + df.B

In [71]:
#reverse
data ={'Subject':['Maths','History','Science','English','Georaphy','Art'],
      'Marks':(45,65,78,65,80,78),
      'CGPA':[2.5,3.0,3.5,2.0,4.0,4.0]}

df=pd.DataFrame(data)
print(df)

    Subject  Marks  CGPA
0     Maths     45   2.5
1   History     65   3.0
2   Science     78   3.5
3   English     65   2.0
4  Georaphy     80   4.0
5       Art     78   4.0

In [75]:
#reverse
df.iloc[::-1, :]

    Subject  Marks  CGPA
5       Art     78   4.0
4  Georaphy     80   4.0
3   English     65   2.0
2   Science     78   3.5
1   History     65   3.0
0     Maths     45   2.5

In [73]:
#reverse
df.loc[df.index[::-1], :]

    Subject  Marks  CGPA
5       Art     78   4.0
4  Georaphy     80   4.0
3   English     65   2.0
2   Science     78   3.5
1   History     65   3.0
0     Maths     45   2.5

In [74]:
#reverse
df.iloc[df.index[::-1], :]

    Subject  Marks  CGPA
5       Art     78   4.0
4  Georaphy     80   4.0
3   English     65   2.0
2   Science     78   3.5
1   History     65   3.0
0     Maths     45   2.5

In [117]:
#Write a program to select the rows, where the sales are greater than 60000 for Mumbai location
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],

'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune', 'Mumbai', 'Pune'],

'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000] })

df_store

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

In [118]:
df=df_store[(df_store['Sales'] >= 60000) & 
            (df_store['Location']== 'Mumbai')]
df

  Store Location  Sales
3     C   Mumbai  90000
8     C   Mumbai  89000

In [7]:
#concatenation of dataframes
#create series
import numpy as np
import pandas as pd
series_a= pd.Series([101,102,103,104,105,106])
series_b=pd.Series([107,108,109,110,111,112])
pd.concat([series_a,series_b])

0    101
1    102
2    103
3    104
4    105
5    106
0    107
1    108
2    109
3    110
4    111
5    112
dtype: int64

In [10]:
df1 = pd.concat([series_a,series_b],axis=1)
df1

     0    1
0  101  107
1  102  108
2  103  109
3  104  110
4  105  111
5  106  112

In [122]:
#add a hierarchical index on Pandas Series
pd.concat([series_a,series_b],keys = ['a','b'])

a  0    101
   1    102
   2    103
   3    104
   4    105
   5    106
b  0    107
   1    108
   2    109
   3    110
   4    111
   5    112
dtype: int64

In [123]:
#label the index
#'names' parameter assigns labels to 'keys' and 'indices'
pd.concat([series_a,series_b],keys=['a','b'],names=['Series','Row ID'])

Series  Row ID
a       0         101
        1         102
        2         103
        3         104
        4         105
        5         106
b       0         107
        1         108
        2         109
        3         110
        4         111
        5         112
dtype: int64

In [ ]:
import numpy as np
import pandas as pd
ser1 = pd.Series(list('abcd'))
ser2 = pd.Series(np.arange(4))

In [2]:
import numpy as np
demo_matrix = np.array(([13,35,74,48], [23,37,37,38],[73,39,93,39]))
demo_matrix[2,3]

39

In [3]:
np.arange(0,22,6)

array([ 0,  6, 12, 18])

In [4]:
demo_array = np.arange(10,17)
demo_array [:]= 101
demo_array

array([101, 101, 101, 101, 101, 101, 101])

In [2]:
!pip install matplotlib

Requirement already satisfied: matplotlib in c:\users\vikipedia\anaconda3\lib\site-packages (3.3.2)
Requirement already satisfied: certifi>=2020.06.20 in c:\users\vikipedia\anaconda3\lib\site-packages (from matplotlib) (2020.6.20)
Requirement already satisfied: pillow>=6.2.0 in c:\users\vikipedia\anaconda3\lib\site-packages (from matplotlib) (8.0.1)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in c:\users\vikipedia\anaconda3\lib\site-packages (from matplotlib) (2.4.7)
Requirement already satisfied: cycler>=0.10 in c:\users\vikipedia\anaconda3\lib\site-packages (from matplotlib) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\vikipedia\anaconda3\lib\site-packages (from matplotlib) (1.3.0)
Requirement already satisfied: numpy>=1.15 in c:\users\vikipedia\anaconda3\lib\site-packages (from matplotlib) (1.19.2)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\vikipedia\anaconda3\lib\site-packages (from matplotlib) (2.8.1)
Requirement already satisfied: six in c:\users\vikipedia\anaconda3\lib\site-packages (from cycler>=0.10->matplotlib) (1.15.0)